<a href="https://colab.research.google.com/github/arora123/Statistics-for-Data-Science-using-Python/blob/main/Categorical_Data_Analysis_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Tabulation & Categorical Data Analysis

* One way, two way & three way tables
* Margin & percentage tables
* Chi-Square Test of Association
* Fisherâ€™s Exact Test of Association

In [ ]:
#@title
# To import data from Google Drive
# from google.colab import drive
# drive.mount('/content/drive')

In [ ]:
#@title
# When you import from local machine in Jupyter/Spyder
# Setting working Directory
# import os
# os.getcwd()
# os.chdir('D:\\Learning\\Learn R\\R_programming data and codes')
# os.getcwd()

## Import Library 
## Import Data

In [ ]:
import pandas as pd

In [ ]:
people=pd.read_csv('https://raw.githubusercontent.com/arora123/Data/master/people2.csv')

### Understand the data

In [ ]:
people.head()

   Subject Eye Color  Height  Hand Span     Sex Handedness Height Cat
0        1     Brown     186        210    Male          R       Tall
1        2     Green     182        220    Male          R       Tall
2        3     Brown     147        167  Female        NaN        NaN
3        4     Green     157        180  Female          L      Short
4        5     Brown     170        193    Male          R     Medium

In [ ]:
people.shape
people.dtypes

Subject        int64
Eye Color     object
Height         int64
Hand Span      int64
Sex           object
Handedness    object
Height Cat    object
dtype: object

In [ ]:
people.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Subject     16 non-null     int64
 1   Eye Color   16 non-null     object
 2   Height      16 non-null     int64
 3   Hand Span   16 non-null     int64
 4   Sex         16 non-null     object
 5   Handedness  13 non-null     object
 6   Height Cat  15 non-null     object
dtypes: int64(3), object(4)
memory usage: 1.0+ KB

In [ ]:
people.dtypes

Subject        int64
Eye Color     object
Height         int64
Hand Span      int64
Sex           object
Handedness    object
Height Cat    object
dtype: object

Subject column is like id number/index of respondents.
we can either delete this column
or make it as row index

In [ ]:
# To delete column 'Subject'

# Approach_1

# del people['Subject']

# however, del people.Subject does not work. Please refer: https://stackoverflow.com/questions/13411544/delete-column-from-pandas-dataframe
        
        
# Approach_2
# people = people.drop('Subject', 1)
# #better way
# people.drop('Subject', 1, inplace=True)

# More tips
# https://stackoverflow.com/questions/13411544/delete-column-from-pandas-dataframe

In [ ]:
# To set 'Subject' column as row index

people.set_index(['Subject'], inplace = True)
people.head()

        Eye Color  Height  Hand Span     Sex Handedness Height Cat
Subject
1           Brown     186        210    Male          R       Tall
2           Green     182        220    Male          R       Tall
3           Brown     147        167  Female        NaN        NaN
4           Green     157        180  Female          L      Short
5           Brown     170        193    Male          R     Medium

In [ ]:
people.describe()

# height
# mean < median; it mean left skewed

# import seaborn as sns
# sns.distplot(people['Height'])

           Height   Hand Span
count   16.000000   16.000000
mean   170.562500  201.562500
std     10.676883   17.947957
min    147.000000  167.000000
25%    165.250000  190.000000
50%    171.500000  203.000000
75%    177.500000  217.250000
max    186.000000  225.000000

In [ ]:
people.describe(include='all')

       Eye Color      Height   Hand Span   Sex Handedness Height Cat
count         16   16.000000   16.000000    16         13         15
unique         3         NaN         NaN     2          2          3
top         Blue         NaN         NaN  Male          R     Medium
freq           7         NaN         NaN    10         11          9
mean         NaN  170.562500  201.562500   NaN        NaN        NaN
std          NaN   10.676883   17.947957   NaN        NaN        NaN
min          NaN  147.000000  167.000000   NaN        NaN        NaN
25%          NaN  165.250000  190.000000   NaN        NaN        NaN
50%          NaN  171.500000  203.000000   NaN        NaN        NaN
75%          NaN  177.500000  217.250000   NaN        NaN        NaN
max          NaN  186.000000  225.000000   NaN        NaN        NaN

In [ ]:
people['Eye Color'].describe()
# uniques means how many categories
# top means mode/most frequent class

count       16
unique       3
top       Blue
freq         7
Name: Eye Color, dtype: object

In [ ]:
people['Eye Color'].count()
# people['Eye Color'].nunique()
# people['Eye Color'].value_counts()
# people['Eye Color'].value_counts().max()

16

In [ ]:
people.Sex.describe()

count       16
unique       2
top       Male
freq        10
Name: Sex, dtype: object

In [ ]:
people.columns

Index(['Eye Color', 'Height', 'Hand Span', 'Sex', 'Handedness', 'Height Cat'], dtype='object')

# One Way Frequency Table

In [ ]:
people['Eye Color'].value_counts()

Blue     7
Brown    6
Green    3
Name: Eye Color, dtype: int64

In [ ]:
people['Eye Color'].value_counts().sum()

16

In [ ]:
people['Eye Color'].value_counts().max()

7

In [ ]:
people['Eye Color']

Subject
1     Brown
2     Green
3     Brown
4     Green
5     Brown
6      Blue
7     Brown
8      Blue
9      Blue
10     Blue
11    Brown
12     Blue
13     Blue
14     Blue
15    Green
16    Brown
Name: Eye Color, dtype: object

In [ ]:
people.Sex

# people.Sex.value_counts()
# Not recommended; people['Sex'] is better way
# https://stackoverflow.com/questions/13411544/delete-column-from-pandas-dataframe

Subject
1       Male
2       Male
3     Female
4     Female
5       Male
6     Female
7       Male
8       Male
9     Female
10    Female
11      Male
12      Male
13      Male
14      Male
15    Female
16      Male
Name: Sex, dtype: object

# Two Way contigency Table/ Cross Tab

In [ ]:
table = pd.crosstab(people['Eye Color'], people['Sex'])
table

Sex        Female  Male
Eye Color
Blue            3     4
Brown           1     5
Green           2     1

# Adding Margins

In [ ]:
# Adding a column of totals
pd.crosstab(people['Eye Color'], people['Sex'], margins=True)

Sex        Female  Male  All
Eye Color
Blue            3     4    7
Brown           1     5    6
Green           2     1    3
All             6    10   16

In [ ]:
# changing name of total column
pd.crosstab(people['Eye Color'], people['Sex'], margins=True, margins_name='Total')

Sex        Female  Male  Total
Eye Color
Blue            3     4      7
Brown           1     5      6
Green           2     1      3
Total           6    10     16

In [ ]:
pd.crosstab(people['Eye Color'], people['Sex']).sum()

people['Sex'].value_counts()

Male      10
Female     6
Name: Sex, dtype: int64

In [ ]:
pd.crosstab(people['Eye Color'], people['Sex']).sum(axis=1)

people['Eye Color'].value_counts()

Blue     7
Brown    6
Green    3
Name: Eye Color, dtype: int64

In [ ]:
pd.crosstab(people['Eye Color'], people['Handedness'])
# pd.crosstab(people['Eye Color'], people['Handedness']).sum()
# pd.crosstab(people['Eye Color'], people['Handedness']).sum(axis=1)
# Only 13 counts out of total 16 indicates missing values

Handedness  L  R
Eye Color
Blue        1  5
Brown       0  5
Green       1  1

In [ ]:
people['Eye Color'].value_counts().sum()

16

In [ ]:
people['Handedness'].value_counts().sum()
# missing values are in 'Handedness' column

13

In [ ]:
pd.crosstab(people['Eye Color'], people['Handedness'], margins=True)

Handedness  L   R  All
Eye Color
Blue        1   5    6
Brown       0   5    5
Green       1   1    2
All         2  11   13

# Percentage Table

In [ ]:
pd.crosstab(people['Eye Color'], people['Sex'], normalize='all').round(2) # percentages with respect to grand total

# from total 100 subjects, 19 % are females with Blue eyes, 31 % are males with brown eyes

Sex        Female  Male
Eye Color
Blue         0.19  0.25
Brown        0.06  0.31
Green        0.12  0.06

In [ ]:
pd.crosstab(people['Eye Color'], people['Sex'], normalize='all').sum() # Column wise sum
# Out of 100 subjects, there are around 37 females and 62 males

Sex
Female    0.375
Male      0.625
dtype: float64

In [ ]:
pd.crosstab(people['Eye Color'], people['Sex'], normalize='all').sum(axis = 1)
# Out of 100 subjects, there are around 44 people with blue eyes, 37 with brown eyes and 19 with green eyes

Eye Color
Blue     0.4375
Brown    0.3750
Green    0.1875
dtype: float64

In [ ]:
pd.crosstab(people['Eye Color'], people['Sex'], margins=True, margins_name='Total', normalize='all').round(2)

# Alternate way
pd.crosstab(people['Eye Color'], people['Sex'], margins=True, margins_name='Percentages', normalize=True).round(2) # same as above

Sex          Female  Male  Percentages
Eye Color
Blue           0.19  0.25         0.44
Brown          0.06  0.31         0.38
Green          0.12  0.06         0.19
Percentages    0.38  0.62         1.00

In [ ]:
pd.crosstab(people['Eye Color'], people['Sex'])

Sex        Female  Male
Eye Color
Blue            3     4
Brown           1     5
Green           2     1

In [ ]:
pd.crosstab(people['Eye Color'], people['Sex'], normalize='columns').round(2)
# If total 100 males, 40 % are having blue eyes, 50 % brown and 10 % green
# If total 100 females, 50 % are having blue eyes, 16.67 % brown and 33.33 % green

# pd.crosstab(people['Eye Color'], people['Sex'], margins=True, margins_name='Percentages', normalize='columns') # Columns wise

Sex        Female  Male
Eye Color
Blue         0.50   0.4
Brown        0.17   0.5
Green        0.33   0.1

In [ ]:
pd.crosstab(people['Eye Color'], people['Sex'], normalize='index').round(2) # Row wise
# pd.crosstab(people['Eye Color'], people['Sex'],  margins=True, margins_name='Percentages', normalize='index')
# out of 100 blue eye color people, 43 % are females and rest are males
# out of 100 brown eye color people, 17 % are females and rest are males
# out of 100 green eye color people, 67 % are females and rest are males

Sex        Female  Male
Eye Color
Blue         0.43  0.57
Brown        0.17  0.83
Green        0.67  0.33

# Three way contigency table

In [ ]:
# pd.crosstab(people['Eye Color'], [people['Sex'], people['Height Cat']] )

# pd.crosstab(people['Eye Color'], [people['Height Cat'], people['Sex']] )


pd.crosstab( [people['Eye Color'], people['Height Cat']] , people['Sex'])


# pd.crosstab(people['Eye Color'], [people['Sex'], people['Height Cat']]) # Eye color in row, sex and heigth cat in columns

Sex                   Female  Male
Eye Color Height Cat
Blue      Medium           3     2
          Tall             0     2
Brown     Medium           0     4
          Tall             0     1
Green     Short            2     0
          Tall             0     1

In [ ]:
# pd.crosstab([people['Eye Color'], people['Sex']], people['Height Cat']) # Notice the difference
# Eye color and sex in row and Height Cat in column

pd.crosstab([people['Eye Color'], people['Sex']], [people['Height Cat'], people['Handedness']])

Height Cat       Medium    Short Tall
Handedness            L  R     L    R
Eye Color Sex
Blue      Female      1  2     0    0
          Male        0  1     0    2
Brown     Male        0  4     0    1
Green     Female      0  0     1    0
          Male        0  0     0    1

# Chi-Square Test of Association

## to test the association between two vategorical variables

**Null hypothesis is 'There is no association between the categorical variables'**
  
  **Alternative hypothesis is 'There is statistically significant association between the categorical variables'**
  
  
  **Rejection Rule:**
  
  p value < alpha - reject the null
  [means the categorical variablea are not associated]
  
  p value > alpha - Fail to reject null
  [means the categorical variables are statistically significantly associated]
  
  
  commonly used value of alpha are:
  
  0.01, 0.05, 0.1

In [ ]:
table = pd.crosstab(people['Eye Color'], people['Sex'])
table

Sex        Female  Male
Eye Color
Blue            3     4
Brown           1     5
Green           2     1

In [ ]:
from scipy.stats import chi2_contingency
chi2_contingency(table)

# Null hypothesis is 'There is no association between Eye Color and Sex variables'

(2.2857142857142856, 0.3189065573239704, 2, array([[2.625, 4.375],
        [2.25 , 3.75 ],
        [1.125, 1.875]]))

In [ ]:
chi_stats, p, dof, expected_f = chi2_contingency(table)

print('chi square statistics here is ', chi_stats.round(2), '\n')
print('Corresponding p-value is ', p.round(2), '\n')
print(dof)
print(expected_f)


6*7/16

chi square statistics here is  2.29

Corresponding p-value is  0.32

2
[[2.625 4.375]
 [2.25  3.75 ]
 [1.125 1.875]]

2.625

It gives chi sqare statistics, p-value and expected frequencies

alpha = 0.05

**Rejection Rule**

p-value = 0.32 > 0.05

Fail to reject the null hypothesis at 5 % level of significance.

**Interpretation:** there is no association between these variables at 5 % level of significancestats.


At 5 % level of significance, the variables 'Eye color' and 'Sex' are indepdent from each other

## Cramer's V

Lies between 0 to 1

symmertic 

## Phi

when we only only two categories

# Fisher's Exact Test

In [ ]:
import scipy.stats as stats
oddsratio, pvalue = stats.fisher_exact(table)
pvalue

# ValueError: The input `table` must be of shape (2, 2).
# Python (scipy.stats) currently does not support fisher_exact test for tables larger than 2 by 2
# R supports this

In [ ]:
table1 = pd.crosstab(people['Sex'], people['Handedness'])
table1

from scipy.stats import fisher_exact
odd_ratio, p = fisher_exact(table1)
print('p value is ', p.round(2))

R supports Fisher's Exact Test for larger cross tables, however as of now python only supports fisher's exact test for 2*2 table
https://stackoverflow.com/questions/25368284/fishers-exact-test-for-bigger-than-2-by-2-contingency-table

# Using researchpy library for categorical data analysis

https://readthedocs.org/projects/researchpy/downloads/pdf/latest/

In [ ]:
#pip install researchpy
# conda install -c researchpy researchpy

import researchpy as rp

In [ ]:
rp.summary_cat(people['Sex'])

Returns a data table as a **Pandas DataFrame** that includes the counts and percentages of each category. 

If there are missing data present (numpy.nan), they will be excluded from the counts. 

However, if the missing data is coded as a string, it will be included as itâ€™s own category.

In [ ]:
rp.summary_cat(people['Sex']).Count
# rp.summary_cat(people['Sex']).Percent
# rp.summary_cat(people['Sex']).Outcome

In [ ]:
rp.summary_cat(people['Sex'], ascending=True) # In ascending order

In [ ]:
rp.crosstab(people['Eye Color'], people['Sex'])

In [ ]:
table, results = rp.crosstab(people['Eye Color'], people['Sex'], test='chi-square')
    
print(table)
results

# Available tests  â€œchi-squareâ€, â€œg-testâ€, â€œmcnemarâ€, or â€œfisherâ€
# 'Yates correction also available'

In [ ]:
# Mosiac Plot
import matplotlib.pyplot as plt
# %matplotlib inline

from statsmodels.graphics.mosaicplot import mosaic
mosaic(people, ['Eye Color', 'Sex'])
plt.show()

# Other Consideration


Post Hoc Tests with correction
https://pythonfordatascience.org/chi-square-test-of-independence-python/


# Plots for categorical Data
Pie chart
Bar Chart/stacked bar chart/grouped bar chart
[Also known as column charts] 
Catplot
Heat Map
Also See: TreeMap, Mosiac Plot